# Data Load into postgreSQL database

In [1]:
# Import Dependencies
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Read in meat consumption CSV file to be loaded to database
csv = "Resources/meat_consumption.csv"
meat = pd.read_csv(csv)
meat.head()

   year  beef  lamb  pork  chicken
0  1974    63    25    10       12
1  1975    67    22    10       13
2  1976    69    18    10       14
3  1977    67    18    11       15
4  1978    57    18    10       17

In [3]:
# Read in meat consumption CSV file to be loaded to database
csv = "Resources/predicted_meat_consumption.csv"
predicted_meat = pd.read_csv(csv)
predicted_meat.head()

   year       beef      lamb       pork    chicken
0  2018  21.346134  8.745080  28.846850  48.220813
1  2019  20.554315  8.399331  29.241685  49.061942
2  2020  19.762497  8.053583  29.636521  49.903072
3  2021  18.970678  7.707835  30.031357  50.744202
4  2022  18.178860  7.362087  30.426193  51.585331

In [4]:
frames = [meat, predicted_meat]

meat_combined = pd.concat(frames)
meat_combined

    year       beef       lamb       pork    chicken
0   1974  63.000000  25.000000  10.000000  12.000000
1   1975  67.000000  22.000000  10.000000  13.000000
2   1976  69.000000  18.000000  10.000000  14.000000
3   1977  67.000000  18.000000  11.000000  15.000000
4   1978  57.000000  18.000000  10.000000  17.000000
5   1979  50.000000  20.000000  15.000000  19.000000
6   1980  49.000000  20.000000  16.000000  18.000000
7   1981  49.000000  19.000000  15.000000  17.000000
8   1982  46.000000  20.000000  15.000000  18.000000
9   1983  42.000000  22.000000  16.000000  17.000000
10  1984  42.000000  23.000000  16.000000  20.000000
11  1985  41.000000  24.000000  17.000000  21.000000
12  1986  39.000000  22.000000  17.000000  21.000000
13  1987  40.000000  23.000000  18.000000  22.000000
14  1988  41.000000  22.000000  18.000000  24.000000
15  1989  40.000000  24.000000  18.000000  25.000000
16  1990  39.000000  23.000000  18.000000  22.000000
17  1991  37.000000  21.000000  19.000000  24.000000
18  1992  35.000000  20.000000  19.000000  24.000000
19  1993  36.000000  19.000000  20.000000  26.000000
20  1994  36.000000  18.000000  20.000000  25.000000
21  1995  34.000000  17.000000  19.000000  26.000000
22  1996  39.000000  16.000000  19.000000  26.000000
23  1997  37.000000  17.000000  19.000000  28.000000
24  1998  36.000000  17.000000  20.000000  29.000000
25  1999  37.000000  18.000000  20.000000  31.000000
26  2000  34.000000  17.000000  18.000000  31.000000
27  2001  33.000000  15.000000  20.000000  33.000000
28  2002  34.000000  14.000000  21.000000  34.000000
29  2003  35.000000  13.000000  23.000000  34.000000
30  2004  33.000000  13.000000  24.000000  36.000000
31  2005  33.000000  13.000000  23.000000  37.000000
32  2006  34.000000  14.000000  26.000000  38.000000
33  2007  32.000000  13.000000  25.000000  36.000000
34  2008  29.000000  11.000000  24.000000  37.000000
35  2009  33.000000  11.000000  26.000000  37.000000
36  2010  31.000000   9.000000  25.000000  44.000000
37  2011  29.000000   9.000000  26.000000  44.000000
38  2012  31.000000   9.000000  26.000000  44.000000
39  2013  30.000000   9.000000  25.000000  45.000000
40  2014  27.000000   9.000000  27.000000  46.000000
41  2015  25.000000   9.000000  28.000000  49.000000
42  2016  25.000000   8.000000  28.000000  49.000000
43  2017  24.000000   8.000000  27.000000  47.000000
0   2018  21.346134   8.745080  28.846850  48.220813
1   2019  20.554315   8.399331  29.241685  49.061942
2   2020  19.762497   8.053583  29.636521  49.903072
3   2021  18.970678   7.707835  30.031357  50.744202
4   2022  18.178860   7.362087  30.426193  51.585331
5   2023  17.387041   7.016338  30.821028  52.426461
6   2024  16.595223   6.670590  31.215864  53.267591
7   2025  15.803404   6.324842  31.610700  54.108720
8   2026  15.011586   5.979094  32.005536  54.949850
9   2027  14.219767   5.633345  32.400371  55.790980

In [5]:
# connect to database
connection_string = "postgres:6186@localhost:5432/redmeat_db"
engine = create_engine(f'postgresql://{connection_string}')

In [6]:
# confirm tables
engine.table_names()

['meat']

 # Load dataframes into database

In [7]:
# use pandas to load dataframes to database
meat_combined.to_sql(name='meat', con=engine, if_exists='append', index=False)

In [8]:
# Check that dataframes have loaded successfully
pd.read_sql_query('select * from meat', con=engine).head()

   id  year  beef  lamb  pork  chicken
0   1  1974    63    25    10       12
1   2  1975    67    22    10       13
2   3  1976    69    18    10       14
3   4  1977    67    18    11       15
4   5  1978    57    18    10       17